#### **Author name:** `Muhammad Salman Saleem`
 **Instagram:** [zzalman0](https://www.instagram.com/zzalman0/)\
 **Facebook:** [zzalman0](https://web.facebook.com/zzalman0/)\
 **Linkdin:** [muhammadsalman010](https://www.linkedin.com/in/muhammadsalman010/)\
 **Github:** [zzalman](https://github.com/zzalman)\
 **Kaggle:** [zzalman](https://www.kaggle.com/zzalman)\
 **Email:** salman793440@gmail.com

# 1 chek version

In [2]:
import pandas as pd
pd.__version__

'2.3.3'

# 2 create dataframe

In [3]:
df = pd.DataFrame({"a":[1,2,3,4],"b":[4,3,2,1]})

In [4]:
df

   a  b
0  1  4
1  2  3
2  3  2
3  4  1

# 3 creating dataframe using numpy

In [5]:
import numpy as np
# first creat arry
arr = np.array([[1,2,3,4],[5,6,7,8]])
arr

array([[1, 2, 3, 4],
       [5, 6, 7, 8]])

# 4 now convert into dataframe

In [6]:
pd.DataFrame(arr)

   0  1  2  3
0  1  2  3  4
1  5  6  7  8

# 5 second method

In [7]:
pd.DataFrame(np.random.rand(2,4),columns=list("abcd"))
# 2 = rows
# 4 = columns
# "abcd" = columnnames

          a         b         c         d
0  0.146505  0.078899  0.706506  0.932361
1  0.807284  0.663094  0.265049  0.994813

# 6 how to rename columns

In [8]:
df = pd.DataFrame({"a":[1,2,3,4],"b":[4,3,2,1]})

In [9]:
df.rename(columns={'a':'column_a','b':'column_b'}, inplace=True)
df
# inplace = Trure means yeah bro makes changes in orignal dataframe

   column_a  column_b
0         1         4
1         2         3
2         3         2
3         4         1

# 7 second method

In [10]:
df.columns=["c_a","c_b"]
df

   c_a  c_b
0    1    4
1    2    3
2    3    2
3    4    1

# 8 how to replace any chracter , string ...

In [11]:
df.columns = df.columns.str.replace('_','*')

In [12]:
df

   c*a  c*b
0    1    4
1    2    3
2    3    2
3    4    1

# 9 add prefixs in columns names

In [13]:
df = df.add_prefix('col_')
df
# just like that you can add sufix

   col_c*a  col_c*b
0        1        4
1        2        3
2        3        2
3        4        1

# 10 now using tamplet data set

In [14]:
import pandas as pd
import numpy as pd
import seaborn as sns

# now load the dataset
jahaz = sns.load_dataset('titanic')
jahaz

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [15]:
jahaz.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

# 11 now to get the summery of the data

In [16]:
jahaz.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

# 12 to include all the other object columns as well

In [17]:
jahaz.describe(include="all")

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
count,891.000000,891.000000,891,714.000000,891.000000,891.000000,891.000000,889,891,891,891,203,889,891,891
unique,NaN,NaN,2,NaN,NaN,NaN,NaN,3,3,3,2,7,3,2,2
top,NaN,NaN,male,NaN,NaN,NaN,NaN,S,Third,man,True,C,Southampton,no,True
freq,NaN,NaN,577,NaN,NaN,NaN,NaN,644,491,537,537,59,644,549,537
mean,0.383838,2.308642,NaN,29.699118,0.523008,0.381594,32.204208,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
std,0.486592,0.836071,NaN,14.526497,1.102743,0.806057,49.693429,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
min,0.000000,1.000000,NaN,0.420000,0.000000,0.000000,0.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25%,0.000000,2.000000,NaN,20.125000,0.000000,0.000000,7.910400,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
50%,0.000000,3.000000,NaN,28.000000,0.000000,0.000000,14.454200,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
75%,1.000000,3.000000,NaN,38.000000,1.000000,0.000000,31.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
max,1.000000,3.000000,NaN,80.000000,8.000000,6.000000,512.329200,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

# 13 to check all columns names

In [18]:
jahaz.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

# 14 to save the data set

In [19]:
jahaz.to_csv("jahaz.csv")
# you can save in various extsion inclusing excel, html etc

# 15 ow load your own data

In [29]:
import pandas as pd

In [30]:
df = pd.read_csv("jahaz.csv")
df.head(5)

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

# 16 now reverse the rows

In [31]:
df.head(2)

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False

In [43]:
df = df.loc[::-1]

In [44]:
df = df.loc[::-1].reset_index(drop=True).head(2)

In [45]:
df

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True
1,889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True

# 17 revrse columns

In [46]:
df.loc[:,::-1].head(2)

,alone,alive,embark_town,deck,adult_male,who,class,embarked,fare,parch,sibsp,age,sex,pclass,survived,Unnamed: 0
0,True,no,Queenstown,NaN,True,man,Third,Q,7.75,0,0,32.0,male,3,0,890
1,True,yes,Cherbourg,C,True,man,First,C,30.00,0,0,26.0,male,1,1,889

# 18 select coulmns by data type

In [76]:
df = pd.read_csv("jahaz.csv")

df.dtypes

Unnamed: 0       int64
survived         int64
pclass           int64
sex             object
age            float64
sibsp            int64
parch            int64
fare           float64
embarked        object
class           object
who             object
adult_male        bool
deck            object
embark_town     object
alive           object
alone             bool
dtype: object

In [77]:
df.select_dtypes(include=['number']).head()

   Unnamed: 0  survived  pclass   age  sibsp  parch     fare
0           0         0       3  22.0      1      0   7.2500
1           1         1       1  38.0      1      0  71.2833
2           2         1       3  26.0      0      0   7.9250
3           3         1       1  35.0      1      0  53.1000
4           4         0       3  35.0      0      0   8.0500

In [78]:
df.select_dtypes(include=['object']).head()

      sex embarked  class    who deck  embark_town alive
0    male        S  Third    man  NaN  Southampton    no
1  female        C  First  woman    C    Cherbourg   yes
2  female        S  Third  woman  NaN  Southampton   yes
3  female        S  First  woman    C  Southampton   yes
4    male        S  Third    man  NaN  Southampton    no

# 19 typecasting

In [84]:
df['deck'] = df['deck'].astype('category')

In [85]:
df.dtypes

Unnamed: 0        int64
survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class            object
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [89]:
df['age'] = df['age'].fillna(df['age'].median()).astype('int64')

In [90]:
df["age"].head()

0    22
1    38
2    26
3    35
4    35
Name: age, dtype: int64

# 20 reduce dataframe size

In [91]:
df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [92]:
df.shape

(891, 15)

In [ ]:
df.sample(frac=0.1).shape
# fraction 0.1 means 10% data of whole data set.

(89, 15)

# 21 split dataset into subdataset

In [94]:
df = pd.read_csv("jahaz.csv")
df.head(5)

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [102]:
df1 = df.sample(frac=0.5, random_state=1)
df1.shape

(446, 16)

In [103]:
df2 = df.drop(df1.index)
df2.shape

(445, 16)

In [104]:
df1.head(2)

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
862,862,1,1,female,48.0,0,0,25.9292,S,First,woman,False,D,Southampton,yes,True
223,223,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True

In [105]:
df2.head(2)

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
7,7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False

In [108]:
len(df1)+len(df2)

891

# 22 filtring of data set

In [115]:
# to take data only where females
df[df.sex == 'female']

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
8,8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
880,880,1,2,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
882,882,0,3,female,22.0,0,0,10.5167,S,Third,woman,False,NaN,Southampton,no,True
885,885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
887,887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

# 23 check unique values

In [ ]:
df.sex.unique()

array(['male', 'female'], dtype=object)

In [120]:
df.embark_town.unique()

array(['Southampton', 'Cherbourg', 'Queenstown', nan], dtype=object)

I want to see the total females who travel from southampton

In [126]:
df[(df['embark_town']=='Southampton') & (df['sex']=='female')].shape

(203, 16)

# 24 filttring by largest values

In [141]:
largest = df["age"].value_counts().nlargest(3)

In [ ]:
df[df['age'].isin(df['age'].value_counts().nlargest(3).index)]
# Use == for ONE value, use isin() for MANY values

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
38,38,0,3,female,18.0,2,0,18.0000,S,Third,woman,False,NaN,Southampton,no,False
49,49,0,3,female,18.0,1,0,17.8000,S,Third,woman,False,NaN,Southampton,no,False
60,60,0,3,male,22.0,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True
80,80,0,3,male,22.0,0,0,9.0000,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
834,834,0,3,male,18.0,0,0,8.3000,S,Third,man,True,NaN,Southampton,no,True
855,855,1,3,female,18.0,0,1,9.3500,S,Third,woman,False,NaN,Southampton,yes,False
858,858,1,3,female,24.0,0,3,19.2583,C,Third,woman,False,NaN,Cherbourg,yes,False
864,864,0,2,male,24.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
882,882,0,3,female,22.0,0,0,10.5167,S,Third,woman,False,NaN,Southampton,no,True

# 26 spliting strings into multipul column

In [156]:
df = pd.DataFrame({'name':['muhammad salman','ali ahmed'],'location':['lahore, pakistan','multan, pakistan']})
df

              name          location
0  muhammad salman  lahore, pakistan
1        ali ahmed  multan, pakistan

In [ ]:
# split the column
df.name.str.split(' ',expand=True)

          0       1
0  muhammad  salman
1       ali   ahmed

In [ ]:
# adding those split columns
df[['first_name','last_name']] = df.name.str.split(' ', expand=True)
df

              name          location first_name last_name
0  muhammad salman  lahore, pakistan   muhammad    salman
1        ali ahmed  multan, pakistan        ali     ahmed

In [166]:
# now expand location
df[['city','country']] = df.location.str.split(",",expand=True)
df

              name          location first_name last_name    city    country
0  muhammad salman  lahore, pakistan   muhammad    salman  lahore   pakistan
1        ali ahmed  multan, pakistan        ali     ahmed  multan   pakistan

In [168]:
# now drop the previous two columns
df.drop(columns=['name','location'])

  first_name last_name    city    country
0   muhammad    salman  lahore   pakistan
1        ali     ahmed  multan   pakistan

In [169]:
df

              name          location first_name last_name    city    country
0  muhammad salman  lahore, pakistan   muhammad    salman  lahore   pakistan
1        ali ahmed  multan, pakistan        ali     ahmed  multan   pakistan

In [ ]:
#now re-arrange columns name 
df =df[['first_name','last_name','name','city','country','location']]
df

  first_name last_name             name    city    country          location
0   muhammad    salman  muhammad salman  lahore   pakistan  lahore, pakistan
1        ali     ahmed        ali ahmed  multan   pakistan  multan, pakistan

# 27 aggregate by multipules groups/ function

In [180]:
# import data set
df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [185]:
df.groupby('who').count()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,adult_male,deck,embark_town,alive,alone
who,,,,,,,,,,,,,,
child,83,83,83,83,83,83,83,83,83,83,13,83,83,83
man,537,537,537,413,537,537,537,537,537,537,99,537,537,537
woman,271,271,271,218,271,271,271,269,271,271,91,269,271,271

In [186]:
df.groupby('who').size()

who
child     83
man      537
woman    271
dtype: int64

In [187]:
df['who'].value_counts()

who
man      537
woman    271
child     83
Name: count, dtype: int64

In [188]:
df['who'].nunique()

3

In [189]:
df.groupby(['sex','pclass','who']).count()

                     survived  age  sibsp  parch  fare  embarked  class  \
sex    pclass who
female 1      child         3    3      3      3     3         3      3
              woman        91   82     91     91    91        89     91
       2      child        10   10     10     10    10        10     10
              woman        66   64     66     66    66        66     66
       3      child        30   30     30     30    30        30     30
              woman       114   72    114    114   114       114    114
male   1      child         3    3      3      3     3         3      3
              man         119   98    119    119   119       119    119
       2      child         9    9      9      9     9         9      9
              man          99   90     99     99    99        99     99
       3      child        28   28     28     28    28        28     28
              man         319  225    319    319   319       319    319

                     adult_male  deck  embark_town  alive  alone
sex    pclass who
female 1      child           3     3            3      3      3
              woman          91    78           89     91     91
       2      child          10     1           10     10     10
              woman          66     9           66     66     66
       3      child          30     2           30     30     30
              woman         114     4          114    114    114
male   1      child           3     3            3      3      3
              man           119    91          119    119    119
       2      child           9     3            9      9      9
              man            99     3           99     99     99
       3      child          28     1           28     28     28
              man           319     5          319    319    319

# 28 select specific columns and rows

In [190]:
df[['sex','age']]

        sex   age
0      male  22.0
1    female  38.0
2    female  26.0
3    female  35.0
4      male  35.0
..      ...   ...
886    male  27.0
887  female  19.0
888  female   NaN
889    male  26.0
890    male  32.0

[891 rows x 2 columns]

# 29 continuos to categorical variable

In [192]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [193]:
df['new_ages'] = pd.cut(df.age ,bins=[0,18,40,60,99], labels=['teen','young','mature','old',])
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,new_ages
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,young
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,young
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,young
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,young
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,young

# 30 convert one set of values to another

In [194]:
df['sex_numeric'] = df.sex.map({'male':0,'female':1})
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,new_ages,sex_numeric
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,young,0
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,young,1
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,young,1
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,young,1
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,young,0

In [195]:
# but what if there are too many catagories and you dont want to make dictionries then use factorize
df['embarked_numeric'] = df.embarked.factorize()[0]
df.head()
# [0] means first category should be 0 and then furthure 1,2,3 as per categories values

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,new_ages,sex_numeric,embarked_numeric
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,young,0,0
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,young,1,1
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,young,1,0
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,young,1,0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,young,0,0

# 31 transpose

In [5]:
import pandas as pd
import numpy as np
df = pd.DataFrame(np.random.rand(200,25),columns=list('asdfghjklzxcvbnmqwertyuio'))
df

,a,s,d,f,g,h,j,k,l,z,...,m,q,w,e,r,t,y,u,i,o
0,0.257024,0.167033,0.807351,0.366782,0.003711,0.989301,0.824834,0.426500,0.652967,0.718172,...,0.228980,0.455914,0.794505,0.196573,0.217223,0.464971,0.336865,0.718481,0.003969,0.293269
1,0.299710,0.041932,0.853784,0.470713,0.775565,0.746612,0.938041,0.533365,0.830170,0.604664,...,0.016634,0.806495,0.440632,0.926189,0.865998,0.081911,0.938375,0.319982,0.350327,0.455458
2,0.473696,0.056046,0.826205,0.077605,0.795450,0.275519,0.791050,0.301032,0.186653,0.009708,...,0.881907,0.796835,0.107637,0.491268,0.588178,0.389136,0.491999,0.378929,0.058069,0.646491
3,0.692684,0.613535,0.383374,0.693764,0.575071,0.098220,0.650669,0.673863,0.691915,0.705978,...,0.903984,0.976356,0.251622,0.901410,0.031386,0.317658,0.718641,0.412605,0.727997,0.244049
4,0.417419,0.082350,0.860416,0.835130,0.688139,0.651645,0.655934,0.301153,0.490751,0.291966,...,0.024885,0.009278,0.332870,0.053260,0.679287,0.793323,0.878050,0.152489,0.818298,0.607875
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
195,0.601675,0.836574,0.775642,0.821037,0.964506,0.202910,0.234032,0.921301,0.471265,0.442734,...,0.195229,0.797499,0.591740,0.668904,0.324260,0.497607,0.743846,0.584303,0.522462,0.395731
196,0.017771,0.075073,0.453252,0.998183,0.154516,0.911882,0.921373,0.276540,0.102496,0.642181,...,0.618394,0.987700,0.767507,0.067420,0.980541,0.233088,0.928331,0.065445,0.758213,0.462084
197,0.431197,0.687512,0.925527,0.443264,0.813359,0.951487,0.361348,0.685917,0.783967,0.374146,...,0.391282,0.697545,0.815618,0.104335,0.307325,0.044525,0.129945,0.745978,0.949663,0.360541
198,0.603139,0.172016,0.904631,0.527779,0.360269,0.710837,0.084640,0.388099,0.878975,0.327107,...,0.603049,0.055304,0.868019,0.610755,0.428934,0.345909,0.222729,0.066088,0.540763,0.226749
199,0.199679,0.256612,0.292294,0.456709,0.465209,0.075146,0.779421,0.634846,0.989745,0.073441,...,0.237735,0.096937,0.620924,0.590677,0.256885,0.656935,0.965103,0.790647,0.817995,0.045214

In [6]:
df.head()

,a,s,d,f,g,h,j,k,l,z,...,m,q,w,e,r,t,y,u,i,o
0,0.257024,0.167033,0.807351,0.366782,0.003711,0.989301,0.824834,0.426500,0.652967,0.718172,...,0.228980,0.455914,0.794505,0.196573,0.217223,0.464971,0.336865,0.718481,0.003969,0.293269
1,0.299710,0.041932,0.853784,0.470713,0.775565,0.746612,0.938041,0.533365,0.830170,0.604664,...,0.016634,0.806495,0.440632,0.926189,0.865998,0.081911,0.938375,0.319982,0.350327,0.455458
2,0.473696,0.056046,0.826205,0.077605,0.795450,0.275519,0.791050,0.301032,0.186653,0.009708,...,0.881907,0.796835,0.107637,0.491268,0.588178,0.389136,0.491999,0.378929,0.058069,0.646491
3,0.692684,0.613535,0.383374,0.693764,0.575071,0.098220,0.650669,0.673863,0.691915,0.705978,...,0.903984,0.976356,0.251622,0.901410,0.031386,0.317658,0.718641,0.412605,0.727997,0.244049
4,0.417419,0.082350,0.860416,0.835130,0.688139,0.651645,0.655934,0.301153,0.490751,0.291966,...,0.024885,0.009278,0.332870,0.053260,0.679287,0.793323,0.878050,0.152489,0.818298,0.607875

In [ ]:
df.head().T
# capital T is for transpose

          0         1         2         3         4
a  0.257024  0.299710  0.473696  0.692684  0.417419
s  0.167033  0.041932  0.056046  0.613535  0.082350
d  0.807351  0.853784  0.826205  0.383374  0.860416
f  0.366782  0.470713  0.077605  0.693764  0.835130
g  0.003711  0.775565  0.795450  0.575071  0.688139
h  0.989301  0.746612  0.275519  0.098220  0.651645
j  0.824834  0.938041  0.791050  0.650669  0.655934
k  0.426500  0.533365  0.301032  0.673863  0.301153
l  0.652967  0.830170  0.186653  0.691915  0.490751
z  0.718172  0.604664  0.009708  0.705978  0.291966
x  0.963391  0.914133  0.965588  0.141414  0.363715
c  0.818158  0.007126  0.876574  0.067304  0.136587
v  0.416025  0.384578  0.634932  0.164148  0.308949
b  0.008190  0.782858  0.501824  0.843072  0.874907
n  0.856670  0.121842  0.991396  0.866171  0.487897
m  0.228980  0.016634  0.881907  0.903984  0.024885
q  0.455914  0.806495  0.796835  0.976356  0.009278
w  0.794505  0.440632  0.107637  0.251622  0.332870
e  0.196573  0.926189  0.491268  0.901410  0.053260
r  0.217223  0.865998  0.588178  0.031386  0.679287
t  0.464971  0.081911  0.389136  0.317658  0.793323
y  0.336865  0.938375  0.491999  0.718641  0.878050
u  0.718481  0.319982  0.378929  0.412605  0.152489
i  0.003969  0.350327  0.058069  0.727997  0.818298
o  0.293269  0.455458  0.646491  0.244049  0.607875

In [8]:
df.describe()

,a,s,d,f,g,h,j,k,l,z,...,m,q,w,e,r,t,y,u,i,o
count,200.000000,200.000000,200.000000,200.000000,200.000000,200.000000,200.000000,200.000000,200.000000,200.000000,...,200.000000,200.000000,200.000000,200.000000,200.000000,200.000000,200.000000,200.000000,200.000000,200.000000
mean,0.461738,0.516725,0.511764,0.501105,0.547400,0.520964,0.530629,0.476794,0.502127,0.493385,...,0.472726,0.515811,0.489579,0.478978,0.489895,0.479322,0.535874,0.529330,0.509627,0.515253
std,0.289218,0.290280,0.285910,0.288618,0.278835,0.278020,0.295338,0.274719,0.284659,0.286019,...,0.294267,0.290377,0.292789,0.293504,0.297118,0.284878,0.299522,0.286394,0.284814,0.288297
min,0.008510,0.003128,0.013409,0.005046,0.002336,0.008776,0.001550,0.002368,0.002252,0.000788,...,0.000839,0.001596,0.005724,0.002961,0.005775,0.000953,0.009745,0.001911,0.002694,0.005147
25%,0.219632,0.266672,0.273902,0.266502,0.345548,0.273504,0.300303,0.249611,0.261624,0.240749,...,0.235546,0.267396,0.224358,0.220978,0.232939,0.229944,0.296005,0.303313,0.281454,0.259798
50%,0.427550,0.529459,0.525058,0.518858,0.546396,0.558935,0.582458,0.472529,0.508503,0.489367,...,0.448191,0.527170,0.507519,0.462861,0.446447,0.493460,0.554615,0.547803,0.509799,0.517595
75%,0.691498,0.758142,0.775682,0.719929,0.784936,0.746068,0.769908,0.710304,0.741090,0.730358,...,0.710613,0.768847,0.746365,0.717542,0.759193,0.725066,0.820477,0.785718,0.755761,0.784640
max,0.998229,0.998458,0.998903,0.998183,0.991198,0.999507,0.994853,0.997220,0.992072,0.995326,...,0.988891,0.997555,0.996570,0.999718,0.992343,0.994156,0.997215,0.997436,0.999937,0.991054

In [11]:
df.describe().T
# by this we can see all the info in one view which is more convinent

   count      mean       std       min       25%       50%       75%       max
a  200.0  0.461738  0.289218  0.008510  0.219632  0.427550  0.691498  0.998229
s  200.0  0.516725  0.290280  0.003128  0.266672  0.529459  0.758142  0.998458
d  200.0  0.511764  0.285910  0.013409  0.273902  0.525058  0.775682  0.998903
f  200.0  0.501105  0.288618  0.005046  0.266502  0.518858  0.719929  0.998183
g  200.0  0.547400  0.278835  0.002336  0.345548  0.546396  0.784936  0.991198
h  200.0  0.520964  0.278020  0.008776  0.273504  0.558935  0.746068  0.999507
j  200.0  0.530629  0.295338  0.001550  0.300303  0.582458  0.769908  0.994853
k  200.0  0.476794  0.274719  0.002368  0.249611  0.472529  0.710304  0.997220
l  200.0  0.502127  0.284659  0.002252  0.261624  0.508503  0.741090  0.992072
z  200.0  0.493385  0.286019  0.000788  0.240749  0.489367  0.730358  0.995326
x  200.0  0.499710  0.293108  0.002778  0.273646  0.497576  0.754341  0.995598
c  200.0  0.491180  0.292285  0.003920  0.235755  0.494771  0.707544  0.998685
v  200.0  0.500934  0.278852  0.003735  0.295418  0.516935  0.731485  0.999861
b  200.0  0.475888  0.294424  0.000877  0.221095  0.458354  0.743848  0.994579
n  200.0  0.502192  0.286484  0.007576  0.251726  0.504003  0.745472  0.993849
m  200.0  0.472726  0.294267  0.000839  0.235546  0.448191  0.710613  0.988891
q  200.0  0.515811  0.290377  0.001596  0.267396  0.527170  0.768847  0.997555
w  200.0  0.489579  0.292789  0.005724  0.224358  0.507519  0.746365  0.996570
e  200.0  0.478978  0.293504  0.002961  0.220978  0.462861  0.717542  0.999718
r  200.0  0.489895  0.297118  0.005775  0.232939  0.446447  0.759193  0.992343
t  200.0  0.479322  0.284878  0.000953  0.229944  0.493460  0.725066  0.994156
y  200.0  0.535874  0.299522  0.009745  0.296005  0.554615  0.820477  0.997215
u  200.0  0.529330  0.286394  0.001911  0.303313  0.547803  0.785718  0.997436
i  200.0  0.509627  0.284814  0.002694  0.281454  0.509799  0.755761  0.999937
o  200.0  0.515253  0.288297  0.005147  0.259798  0.517595  0.784640  0.991054

# 32 reshaping the dataframe

In [19]:
fasla = pd.DataFrame({'zip':['12345','34567','67898'],'factory':[100,400,700],'retail':[300,600,900]})
fasla.head()

     zip  factory  retail
0  12345      100     300
1  34567      400     600
2  67898      700     900

In [23]:
fasla2 = pd.DataFrame({'zip':['12345','34567'],'location_type':['factory','retail']})

In [24]:
fasla2

     zip location_type
0  12345       factory
1  34567        retail

In [25]:
fasla.melt(id_vars=['zip'],var_name='location_type',value_name='distance')

     zip location_type  distance
0  12345       factory       100
1  34567       factory       400
2  67898       factory       700
3  12345        retail       300
4  34567        retail       600
5  67898        retail       900